# IsValidHorizontalBoundary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryValidation..::..IsValidHorizontalBoundary Method
BoundaryValidation Class See Also
---
Identifies whether the given curve loops compose a valid horizontal boundary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool IsValidHorizontalBoundary(
	IList<CurveLoop> curveLoops
)
```

Visual Basic
---
```text
Public Shared Function IsValidHorizontalBoundary ( _
	curveLoops As IList(Of CurveLoop) _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidHorizontalBoundary(
	IList<CurveLoop^>^ curveLoops
)
```

# ### Parameters
curveLoops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> The curve loops to be checked.
# ### Return Value
True if the given curve loops are valid as described above, false otherwise.
# Remarks
The curve loops are valid if projections of the loops onto a horizontal(XY) plane do not intersect each other; each curve loop is closed; input curves do not contain any helical curve; and each loop is planar and lies on a plane parallel to the horizontal(XY) plane, but not necessarily the same plane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BoundaryValidation Class
Autodesk.Revit.DB Namespace